app/views/leaderboard/top_results.html.erb

                                    <h1 class="alert alert-success" style="width: 300px; font-size: 16px;">
                                        <%= User.find(score.user_id).email %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]