app/controllers/leaderboard_controller.rb

  def user_results
  	@counter = 0
  	@user_scores = Score.where(:user_id => current_user.id)
---
SELECT  "scores".* FROM "scores" WHERE "scores"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def top_results
  	@counter = 0
  	@user_scores = Score.all
---
SELECT "scores".* FROM "scores"