app/controllers/scores_controller.rb

  def index
    @scores = Score.all
---
SELECT "scores".* FROM "scores"

  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save
---
INSERT INTO "scores" ("user_id", "wpm", "accuracy", "points", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["wpm", 222], ["accuracy", 100], ["points", 222], ["created_at", 2017-04-23 20:56:10 UTC], ["updated_at", 2017-04-23 20:56:10 UTC]]

    def set_score
      @score = Score.find(params[:id])
---
SELECT  "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]