app/controllers/user_controller.rb

  def analytics
  	@avg_wpm = 0;
  	@avg_accr = 0;
  	@num_of_tests = 0;

  	@user_scores = Score.where(:user_id => current_user.id)
---
SELECT "scores".* FROM "scores" WHERE "scores"."user_id" = ?  [["user_id", 7]]